Revit 2024 API
AnalysisDisplayStyle.SetVectorSettings Method
 Set vector settings object for the style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public void SetVectorSettings(
	AnalysisDisplayVectorSettings vectorSettings
)
Visual Basic
Public Sub SetVectorSettings ( _
	vectorSettings As AnalysisDisplayVectorSettings _
)
Visual C++
public:
void SetVectorSettings(
	AnalysisDisplayVectorSettings^ vectorSettings
)
Parameters
vectorSettings
Type: Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  Vector settings were not created with the object.
See Also
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace